app/views/comments/_comments.html.erb

<div class="panel panel-primary">
  <% @post.comments.each do |comm| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]