app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if (@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Another post"], ["body", "This is another post"], ["created_at", "2018-09-17 23:58:20.038924"], ["updated_at", "2018-09-17 23:58:20.038924"]]

  def update
    @post = Post.find(params[:id])
    if (@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "This is my first post. Yay!🔥\r\n"], ["updated_at", "2018-09-20 21:18:33.010676"], ["id", 1]]